IRP/src/AccumulationRegisters/GoodsReceiptSchedule/GoodsReceiptSchedule.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>GoodsReceiptSchedule</name>
 <resources>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <attributes>
  <name>DeliveryDate</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Order</name>
  <type>
   <types>DefinedType.typeOrders</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Store</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>RowKey</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/GoodsReceiptSchedule/ManagerModule.bsl
Function GetLockFields(Data) Export
	Result = New Structure();
	Result.Insert("RegisterName", "AccumulationRegister.GoodsReceiptSchedule");
	Fields = New Map();
	Fields.Insert("Company", "Company");
	Fields.Insert("Order", "Order");
	Fields.Insert("Store", "Store");
	Fields.Insert("ItemKey", "ItemKey");
	Result.Insert("LockInfo", New Structure("Data, Fields", Data, Fields));
	Return Result;
EndFunction
